Revit 2027 API
StairsType.MiddleSupportType Property
 The type of middle supports used in the stair.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId MiddleSupportType { get; set; }
Public Property MiddleSupportType As ElementId
	Get
	Set
public:
property ElementId^ MiddleSupportType {
	ElementId^ get ();
	void set (ElementId^ value);
}
member MiddleSupportType : ElementId with get, set
Property Value
ElementId
 invalidElementId if the stairs type has no middle support.
Exceptions
Exception | Condition
ArgumentException |  When setting this property: supportType is not a valid support type.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The stairs type has no middle support so the data being set is not applicable.
See Also
Reference
StairsType Class
Autodesk.Revit.DB.Architecture Namespace